#pragma once

//返回值
enum RET_CODE
{
	RET_ERROR = -1,                         //错误，入参为空？
	RET_SUCCESS                              //成功
};

//初始化报文结构
/*******************************************
 * Type：       1字节      报文类型
 * CNum：    1字节      摄像头数量
 * ******************************************/
 /*
0           1           2
+-------+-------+
| Type |CNum|
+-------+-------+
*/

//初始化报文结构体
typedef struct
{
	int8_t m_iType;//报文类型
	int8_t m_iCamNum;//有几个摄像头
}InitMsg;
//数据传输数据结构
/*******************************************
 * Type：       1字节      报文类型
 * CNUM：    1字节      摄像头数量
 * ******************************************/
 /*
0           1           2           3           4
+-------+-------+-------+-------+
| Type |CNum|
+-------+-------+-------+-------+
*/
typedef struct
{
	int8_t m_iType;//报文类型
	int8_t m_i;

}DataTransMsg;